trwbox/micropython/ports/esp32/network_wlan.c
# Scan a couple channels and see the time it takes to when the in_progress changes back to false
def scan_wifi():
    import time
    nic.scan_non_blocking(channel=[2, 3], scan_time_active_min=2000, scan_time_active_max=4000, blocking=False)
    print("We have moved on from that code, and in_progress is: " + str(nic.in_progress()))
    start = time.time_ns()
    while (nic.in_progress()):
        pass
    end = time.time_ns()
    print("Total time: " + str((end - start) / 1000000000.0) + " seconds")

import esp; esp.osdebug(esp.LOG_INFO); import network; nic = network.WLAN(network.STA_IF); nic.active(True);
count = 0
while True:
    print("Iteration: " + str(count))
    nic.scan_non_blocking()
    count = count + 1

# See if the garbage collector is cleaning everything up
def garbage_check():
    import gc
    gc.collect()
    starting_mem = gc.mem_free()
    nic.scan_non_blocking()
    ending_mem = gc.mem_free()
    gc.collect()
    cleaned = gc.mem_free()
    print("starting: " + str(starting_mem) + " ending: " + str(ending_mem) + " cleaned: " + str(cleaned))
    print("overall difference: " + str(starting_mem - cleaned) + " bytes")

# Do it in a loop to try for a memory leak to show up
def garbage_loop(num_loops: int = 100, channel=0):
    import gc
    starting_mem = gc.mem_free()
    for i in range(num_loops):
        loop_start= gc.mem_free()
        nic.scan_non_blocking(channel=channel)
        gc.collect()
        loop_end = gc.mem_free()
        print("Loop interation " + str(i) + " mem changed: " + str(loop_start - loop_end))
    ending_mem = gc.mem_free()
    gc.collect()
    cleaned = gc.mem_free()
    print("starting: " + str(starting_mem) + " ending: " + str(ending_mem) + " cleaned: " + str(cleaned))
    print("overall difference: " + str(starting_mem - cleaned) + " bytes")
*/

static mp_obj_t network_wlan_non_blocking_scan(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    static const mp_arg_t allowed_args[] = {
        // Create the list of optional elements that can be given, starting with the self object that
        // will always exist 
        { MP_QSTR_self, MP_ARG_REQUIRED | MP_ARG_OBJ, { .u_obj = mp_const_none }},
        // If the scan should be sent to the blocking
        { MP_QSTR_blocking, MP_ARG_KW_ONLY | MP_ARG_BOOL, { .u_bool = true }},
        // The channel, or list of channels that should be scanned
        { MP_QSTR_channel, MP_ARG_KW_ONLY | MP_ARG_OBJ, { .u_obj = mp_const_none }},
        // The ssid string that should be scanned for, default of None
        { MP_QSTR_ssid, MP_ARG_KW_ONLY | MP_ARG_OBJ, { .u_obj = mp_const_none }},
        // The mac address bssid that should be scanned for, default is None
        { MP_QSTR_bssid, MP_ARG_KW_ONLY | MP_ARG_OBJ, { .u_obj = mp_const_none }},
        // If hidden networks should be shown, default of false
        { MP_QSTR_show_hidden, MP_ARG_KW_ONLY | MP_ARG_BOOL, { .u_bool = false }},
        // If the scan should be active with WIFI_SCAN_TYPE_ACTIVE
        { MP_QSTR_active_scan, MP_ARG_KW_ONLY | MP_ARG_BOOL, { .u_bool = true }},
        // Time to passive scan, default 360 ms
        { MP_QSTR_scan_time_passive, MP_ARG_KW_ONLY | MP_ARG_INT, { .u_int = 360 }},
        // Min time to spend actively scanning, default of 0 ms
        { MP_QSTR_scan_time_active_min, MP_ARG_KW_ONLY | MP_ARG_INT, { .u_int = 0 }},
        // Max time to spend actively scanning, default of 120 ms
        { MP_QSTR_scan_time_active_max, MP_ARG_KW_ONLY | MP_ARG_INT, { .u_int = 120 }},
        // Time to spend on the home channel between hops if connected to a wifi network to not lose connection, defaults to 30ms
        { MP_QSTR_home_chan_dwell_time, MP_ARG_KW_ONLY | MP_ARG_INT, { .u_int = 30 }},
        // Callback function that will be called with the results from the scan after the non-blocking scan has completed
        { MP_QSTR_callback, MP_ARG_KW_ONLY | MP_ARG_OBJ, { .u_obj = mp_const_none }}
    };

    // Get the args to the function based on the keywords
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    // Raise an error if the scan is already happening
    if (scan_in_progress) {
        mp_raise_msg(&mp_type_RuntimeError, MP_ERROR_TEXT("Scan is already running, cannot start another scan"));
    }

    // check that STA mode is active
    wifi_mode_t mode;
    esp_exceptions(esp_wifi_get_mode(&mode));
    if ((mode & WIFI_MODE_STA) == 0) {
        mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("STA must be active"));
    }

    // Setup some variables
    // Should the scan be blocking
    bool blocking = false;
    /// The channel to scan for a single
    int scan_channel = 0;
    // If there is a list to scan
    bool scan_list = false;

    /// TODO: Check that blocking is valid. I don't think it should ever not be with MP_ARG_BOOL, but unsure
    blocking = args[1].u_bool;

    // Check that the channels are properly typed
    // If the object is an integer, then it's a single channel scan
    if (mp_obj_is_int(args[2].u_obj)){
        int chan = mp_obj_get_int(args[2].u_obj);
        ESP_LOGD("wifi_blocking_mod", "Got a single channel %d", chan);
        if (chan > 14 || chan < 0){
            mp_raise_msg(&mp_type_ValueError, MP_ERROR_TEXT("Bad channel value, expecting 1-14"));
        }
        scan_channel = chan;
        /// TODO: Should this force the remaining_channels list to 0 items?
    // Check if the object is a list or tuple
    } else if (mp_obj_is_type(args[2].u_obj, &mp_type_list) || mp_obj_is_type(args[2].u_obj, &mp_type_tuple)){
        ESP_LOGI("wifi_blocking_mod", "Got a list of channels to scan");
        mp_obj_t channel_list = args[2].u_obj;
        int channel_count = mp_obj_get_int(mp_obj_len(channel_list));
        // Check if there are more channels than possible
        if (channel_count > 14) {
            mp_raise_msg(&mp_type_ValueError, MP_ERROR_TEXT("More channels supplied than were possible to scan"));
        // There were no channels given, but there was an array
        } else if(channel_count == 0){
            mp_raise_msg(&mp_type_ValueError, MP_ERROR_TEXT("An array with no channels to scan is invalid"));
        }

